<ion-header>
    <ion-navbar>
        <ion-title>
            Smilefjes og Spisested
        </ion-title>
    </ion-navbar>
</ion-header>

<ion-content padding>
    <p>Appen henter data fra <a href="http://data.norge.no/data/mattilsynet/smilefjestilsyn-p%C3%A5-serveringssteder">data.norge.no</a> som er en samling av &aring;pne offentlige datasett i norge.</p>
    <p>
        Om datasettet st&aring;r det f&oslash;lgende:<br/>
        <i>Data fra smilefjestilsyn gir en samlet oversikt over alle serveringssteder som er omfattet av smilefjesordningen (smilefjesforskriften) og tilsynsresultatene fra Mattilsynets tilsyn fra 1.1. 2016 fram til dags dato.</i>
    </p>
    <p>
        Appen ble inspirert av en <a href="http://www.dagbladet.no/mat/urettferdig-at-noen-restauranter-jukser-med-smilefjes/67608635">artikkel i dagbladet</a> den 27. Mai 2017. I <a href="https://lovdata.no/dokument/SF/forskrift/2015-09-25-1141"> lovdata.no </a> st&aring;r det f&oslash;lgende paragrafer om smilefjesrapporten:
    </p>
    <ion-card>
        <ion-card-header>
            § 2.Virkeomr&aring;de
        </ion-card-header>
        <ion-card-content>
            Forskriften gjelder for serveringssteder som er allment tilgjengelige og som tilbereder, serverer og omsetter mat til forbrukerne og som er tilrettelagt og beregnet for at maten skal spises p&aring; stedet i permanente serveringsomr&aring;der (restauranter og kaféer o.l.). Forskriften gjelder ikke for kantiner, matservering p&aring; institusjoner, bensinstasjoner eller storkiosker.
        </ion-card-content>
    </ion-card>
    <ion-card>
        <ion-card-header>
            § 3. Smilefjesrapporten
        </ion-card-header>
        <ion-card-content>
            Smilefjesrapporten er en standardisert skriftlig rapport som skal gi forbrukerne tilrettelagt informasjon, der resultatet av det gjennomf&oslash;rte tilsynet er uttrykt ved ett av tre mulige smilefjessymboler.<br/> a) <i class="material-icons">sentiment_very_satisfied</i>: Mattilsynet har ikke funnet brudd p&aring; regelverket eller har bare funnet bagatellmessige brudd p&aring; regelverket og p&aring;pekt dette.<br/> b) <i class="material-icons">sentiment_neutral</i>: Mattilsynet har funnet brudd p&aring; regelverket og gitt forh&aring;ndsvarsel eller fattet n&oslash;dvendige vedtak.<br/> c) <i class="material-icons">sentiment_dissatisfied</i>: Mattilsynet har funnet alvorlige eller gjentatte brudd p&aring; regelverket og gitt forh&aring;ndsvarsel eller fattet n&oslash;dvendige vedtak.<br/> Smilefjesrapporten inneholder i tillegg informasjon om hva som er kontrollert og hvilke funn som er gjort samt smilefjessymbolene fra inntil tre tidligere tilsyn. Smilefjesrapporten kommer i tillegg til den ordin&aelig;re tilsynsrapporten.
        </ion-card-content>
    </ion-card>
    <ion-card>
        <ion-card-header>
            § 4.Offentliggjøring på serveringsstedet
        </ion-card-header>
        <ion-card-content>
            Serveringsstedet skal henge opp smilefjesrapporten straks Mattilsynet har levert den. Smilefjesrapporten skal henges opp godt synlig slik at forbrukerne f&aring;r informasjonen f&oslash;r de g&aring;r inn p&aring; serveringsstedet. For serveringssteder som p&aring; grunn av sin plassering ikke har eget inngangsparti, skal smilefjesrapporten plasseres godt synlig slik at forbrukerne f&aring;r informasjonen f&oslash;r de velger om de vil spise p&aring; serveringsstedet. Serveringsstedet skal ikke gj&oslash;re endringer i eller tilf&oslash;yelser til smilefjesrapporten. Smilefjesrapporten skal henges opp selv om serveringsstedet klager p&aring; resultatet av tilsynet eller ber om oppf&oslashlging etter § 6.
        </ion-card-content>
    </ion-card>
    <ion-card>
        <ion-card-header>
            § 5.Publisering
        </ion-card-header>
        <ion-card-content>
            Mattilsynet skal publisere tilsynsresultatene digitalt innen fem virkedager etter gjennomf&oslash;rt tilsyn.
        </ion-card-content>
    </ion-card>

    <p>
        Kildekode til appen kan finner du p&aring; <a href="https://github.com/cruor99/Smilefjesapp">github.com/cruor99</a><br/>
        App laget av Kjetil Andre Liknes
    </p>


</ion-content>
